# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple (adjust to match ResNet-18)
width_multiple: 1.0  # layer channel multiple (adjust to match ResNet-18)
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone (ResNet-18)
backbone:
  # [from, number, module, args]
  [
    [-1, 1, Conv, [64, 7, 2, 3]],  # Initial convolution
    [-1, 1, nn.MaxPool2d, [3, 2, 1]],  # Maxpool layer
    [-1, 1, BasicBlock, [64, 64]],  # ResNet BasicBlock with 64 channels
    [-1, 2, BasicBlock, [64, 64]],  # Two more BasicBlocks with 64 channels
    [-1, 1, Conv, [128, 3, 2, 1]],  # Conv layer with stride 2
    [-1, 2, BasicBlock, [128, 128]],  # Two BasicBlocks with 128 channels
    [-1, 1, Conv, [256, 3, 2, 1]],  # Conv layer with stride 2
    [-1, 2, BasicBlock, [256, 256]],  # Two BasicBlocks with 256 channels
    [-1, 1, Conv, [512, 3, 2, 1]],  # Conv layer with stride 2
    [-1, 2, BasicBlock, [512, 512]],  # Two BasicBlocks with 512 channels
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
